/**
 * 
 * @authors Lewis Tian (chasetichlewis@gmail.com)
 * @date    2017-10-15 19:46:00
 * @version $Id$
 */

/* 鼠标点击特效 */
var a_idx = 0;
jQuery(document).ready(function($) {
    $("body").click(function(e) {
        var a = new Array("富强", "民主", "文明", "和谐", "自由", "平等", "公正" ,"法治", "爱国", "敬业", "诚信", "友善");
        var $i = $("<span/>").text(a[a_idx]);
        a_idx = (a_idx + 1) % a.length;
        var x = e.pageX,
            y = e.pageY;
        $i.css({
            "z-index": 9999,
            "top": y - 20,
            "left": x,
            "position": "absolute",
            "font-weight": "bold",
            "color": "#ff6651"
        });
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
        1500,
        function() {
            $i.remove();
        });
    });
});

/* 点击头像更换b站挂件 */
var title = ['#EveOneCat','2018','2018超','2019创作新秀','2019拜年祭·典藏','2019拜年祭·纪念','2020拜年祭（鼠）','233','35P','7月暑期打卡','8月打卡肝帝','bilibili冬','bilibili夏','bilibili春','bilibili秋','BML2019 Lv1','BML2020光明版','BML2020暗黑版','BML麦克风','BW2020','BW广州指挥官','B站邮政限定','citrus','cool','dd','FDG','FFF团','Free！','fubuki','GDesignX0','hanser','Infini-T Force','Key','Kizuna AI','magic','MakeS','meaqua','meaquafoof','meaqua糖','Miko恩济西塔','Minai小姐','MVP玩家','OVERLORD','pekomiko','POWER UP 2018','prpr','QY大佬nb','roza','RX-0 (NT-D)','S10-SN','S10-TES','S8-EDG战队','S8-IG战队','S8-RNG战队','S8冠军-IG','saber','towasama','UP主学园-学员','vlogger','X契约','YUE','zio','一起吃月饼','一起看电竞','七海Nana7mi','七濑胡桃','七魔女应援','万界仙踪','三周年恋曲','不吉波普不笑','不良人','专栏2周年','两周年漫画家','中国绊爱','中野一花','中野三玖','中野二乃','中野五月','中野四叶','主站主播头像框','久美子','乐正绫五周年生日','乐正龙牙三周年','书乃精神食粮','买买买','云1','交汇的世界','京华','人形自走放炮姬','从零开始的魔法书','仓鼠','作文鬼才','你好世界','修仙做大牌','元龙锦鲤框','充值礼包限定挂件','全明星','全职高手','公主连结佩可莉姆','公主连结凯露','公主连结可可萝','冯宝宝','冰菓','冲出太阳系','凹凸世界','刀说异数','创作激励新秀奖','创想无双','初音未来13周年','别人画的想用而已','刺客伍六七','剑网3十周年','加藤惠','动感DJ','十年大会员','千夜粉丝','博丽灵梦','危险的老婆','原神','双生视界·花嫁','叛逆性百万亚瑟王','可莉','史努比70周年','吉尔伽美什','吐彩虹','和风','咖喱','咩啊','咩夸','哈啦咻','哔哩哔哩活动 2018冬','哔哩哔哩活动 2018秋','哔哩哔哩超级发电厂','哔哩星人召唤','哔哩王','啊这','喂，看见耳朵啦','四元取代','围观群众','国宝锦鲤','国民老公带回家','圣诞帽','圣诞节快乐','地中海','坂本','埃罗芒阿老师','墨墨','声控','夏日福利限定挂件','夏目友人帐','外设','夜空','大王不高兴','大理寺日志','天官一周年庆','天官赐福动画','天谕','头号玩家','好耶','如月晴人','学霸','守护之翼','完美存档','实验品家庭','寒假玩什么','小主安康','小圆','小秦','小绿和小蓝','小试身手','小闪电','小魔女学园','少前小剧场','少女前线','少年歌行','局座','峡谷食神','巅峰荣耀','工作细胞','布洛妮娅','幕后交易','干杯十周年·典藏','干杯十周年·珍藏','平安物语','年度打卡挑战','年度猫片','应援奖励','开封奇谈','异常生物','张京华','张嘴吃药','影分身','影帝','御坂','御坂美琴','忍3夏日祭','快把我哥带走','恋爱暴君','恰柠檬','想peach','我与B站九周年','我也不知道叫什么名字','我家大师兄脑子有坑','我是江小白','战斗吧歌姬','拉文克劳','拜年祭粉丝专鼠','择天记','拳皇','拾又之国','摸鱼','攻略组','放肆大学','救援队系列','整装待发','文文','文豪','文豪试炼Ⅴ','斗破苍穹','斩兽之刃','断幺九干不死','斯莱特林','新科娘','无限小电视','明日方舟-森蚺','明日方舟','星座系列：天秤座','星座系列：天蝎座','星座系列：射手座','春原庄的管理人小姐','晴明','暮光幻影','暮间雨茗','月下望月','月影海','有问哔答','木之本樱','木有名字001','柠檬头像挂件','格兰芬多','梦100','梦塔·雪谜城','梦蝶','欢庆盛典','欧皇玩家','正义之士','步天歌应援','毕业季','汉化日记','沈剑心','没有人比我更懂小闪电','没有梦想的咸鱼','泠鸢yousa','洛天依8th生日纪念','浴室情缘','海面','淅佬画的希儿','游戏假期','游鱼','湊-阿库娅','漫画月票荣誉挂件','激情三连','激情三连·典藏','灵笼','爱丽丝','狗狗','猪年专属','王子碰碰球','环游世界','琉绮Ruki','琪露诺','璇瑜的小挂件','甜蜜告白','生草姬老八专用','用爱放铳','电磁力机甲','画江湖之侠岚','登乐V计划','百妖谱','百鬼绫目','百鬼绫目头像框','皇冠','真香','知识分享官','碧蓝之海','碧蓝航线','碧蓝航线2020','神乐','神楽Mea','神灵凭依','神谕法阵','秋季','租借女友','秦天','章鱼和草莓','精灵王','约战·狂三','约战：精灵再临','纳米核心','维多利加看书','美术馆女神','聪明可爱小笨比希薇娅','脑斧帽','脑洞大开','自己用','自用','自用装饰缩减版','至尊戒','至高守护','花园Serena','茶啊二中','萌妻食神','蕾米和咲夜','血色苍穹','观星','言和7th生日纪念','记忆U盘','说唱新世代','请吃红小豆','贴贴','赫奇帕奇','跑跑卡丁车','轻视频夏日祭','轻车熟路','过过过','还有醒着的么','远坂凛','迷影者','追番党','金秋乐明','闪电侠','阴阳师·平安物语','阴阳师海国之境','阴阳师花鸟卷','阿萨Aza','雾山五行','霹雳布袋戏','领风者','首批购买大会员','首批购买年度大会员','高温','鬼灭之刃','魔兽精英','魔法至上','鹖冠子','鹿乃','黄绿合战5th','黑暗之环','黑暗剑','黑暗料理','黑白无双','龙族幻想',]
var counts = title.length
var init = Math.floor(Math.random()*counts)
$(".site-author").prepend("<img class='site-avatar-plug-bilibili'/>");
$(".site-avatar-plug-bilibili").attr("src", "/blog/images/bili-pendant/bili-" + init + ".png")
$(".site-avatar-plug-bilibili").attr("title", '点我看看有什么效果~')
$(".site-author-image").attr("title", title[init])
jQuery(document).ready(function($) {
    $(".site-author-image").click(function(e) {
        init = Math.floor(Math.random()*counts)
		$(".site-avatar-plug-bilibili").attr("src", "/blog/images/bili-pendant/bili-" + init + ".png")
		$(".site-author-image").attr("title", title[init])
    });
});